---
kind: type
id: T:Autodesk.Revit.DB.HorizontalAlign
source: html/1c390794-4ca5-8589-b838-b5842e727736.htm
---
# Autodesk.Revit.DB.HorizontalAlign

Horizontal alignment of model text.

## Syntax (C#)
```csharp
public enum HorizontalAlign
```